title: detection title
description: detection description
status: experimental
author: Reyad
level: medium

logsource:
    product: any
    category: any
detection:
  selection1:
    CommandLine|contains:
      - shadow
      - passwd
  selection2:
    CommandLine|contains:
      - "cat "
      - "nano "
      - "vim "
      - "vi "
      - "grep "
      - tail
  condition: selection1 and selection2
fields:
  - CommandLine
  - ParentCommandLine
  - Image
